package com.geekerstar.tdengine.module.sample.test;

import java.sql.Connection;
import java.sql.DriverManager;
import java.sql.SQLException;
import java.sql.Statement;
import java.util.Arrays;
import java.util.List;


public class RestInsertExample {
    private static Connection getConnection() throws SQLException {
        String jdbcUrl = "jdbc:TAOS://172.201.10.76:6030?user=root&password=taosdata";
        return DriverManager.getConnection(jdbcUrl);
    }


    public static void insertData() throws SQLException {
        try (Connection conn = getConnection()) {
            try (Statement stmt = conn.createStatement()) {
                String sql = getSQL();
                int rowCount = stmt.executeUpdate(sql);
                System.out.println("rowCount=" + rowCount); // rowCount=8
            }
        }
    }

    private static String getSQL() {
        return "INSERT INTO car.can_10001 USING car.can TAGS (10001) VALUES ( '2023-05-09 14:15:08', '车辆启动状态', '未充电', '纯电', '0', '55196.1', '597.4', '13.2', '92', '工作', '无驱动力', '无制动力', '自动D挡', '42727', '0', '0', 1, '[{\"驱动电机序号\":1,\"驱动电机状态\":\"准备状态\",\"驱动电机控制器温度\":\"43\",\"驱动电机转速\":\"0\",\"驱动电机转矩\":\"0\",\"驱动电机温度\":\"57\",\"驱动电机控制器输入电压\":\"590\",\"驱动电机控制器直流母线电流\":\"0\"}]', '有效定位', '104.102333', '30.706884', 6, 193, '3.322', 2, 48, '3.317', 1, 1, '26', 7, 37, '22', '无报警', '00000000000000000000000000000000', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 0, 0, 0, NULL, NULL, '0000B8D2', 'FFFF', '未知类型', '未知类型', '无报警', '无目标', '无预警', '无预警', '-7.374', '-32', '相对测量原则', '0.080', '-6.687', '-0.500', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '触发报警', '未知类型', '触发一次抓拍', '检测到司机', '255', '未知类型', '未知类型', '停车状态', '预警', '111111.100', '无错误', '禁用，视同有报警', '偏离预警', '偏离预警', '前车碰撞预警', '有行人碰撞预警', '有行人处于预警区域，预警', '开启', '未知类型', '车距大于设定值，一级报警', '未知类型', '4x2轮（前单 后双）', '休止状态', '21', '21', '0', '0', '20', '21', '150', '关', '开', '关', '关', '关', '关', '关', '关', '未碰撞', '关', '27.60', '1744.50', '2512.50', '转向灯关闭', '关闭', '未知类型', '关闭', '传感器工作正常', '传感器工作正常', '传感器工作正常', '传感器工作正常', '传感器工作正常', '传感器工作正常', '未知类型', '未知类型', '未知类型', '未知类型', '95.60', '正常', '26', '22', '23', '64.01', '62.73', '62.99', 0, 0, 6, '[{\"轮胎位置\":\"第1轴左外侧\",\"轮胎压力\":107,\"轮胎温度\":\"769.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"},{\"轮胎位置\":\"第2轴左外侧\",\"轮胎压力\":107,\"轮胎温度\":\"513.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"},{\"轮胎位置\":\"第1轴左内侧\",\"轮胎压力\":112,\"轮胎温度\":\"257.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"},{\"轮胎位置\":\"第2轴左内侧\",\"轮胎压力\":111,\"轮胎温度\":\"1281.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"},{\"轮胎位置\":\"未知类型左内侧\",\"轮胎压力\":110,\"轮胎温度\":\"1281.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"},{\"轮胎位置\":\"未知类型左内侧\",\"轮胎压力\":111,\"轮胎温度\":\"1.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"}]', 10, '[{\"箱内灭火电池箱号\":1,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":4},{\"箱内灭火电池箱号\":2,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":5},{\"箱内灭火电池箱号\":3,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":6},{\"箱内灭火电池箱号\":4,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":7},{\"箱内灭火电池箱号\":5,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":14},{\"箱内灭火电池箱号\":6,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":15},{\"箱内灭火电池箱号\":7,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":0},{\"箱内灭火电池箱号\":8,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":1},{\"箱内灭火电池箱号\":9,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":2}]', '0000', 1656911569520562176, 10001, '06220001', 1, '2023-05-09 14:15:08' );";
    }

    public static void main(String[] args) throws SQLException {
        insertData();
    }
}
