package com.geekerstar.tdengine;

import cn.hutool.json.JSONUtil;
import com.geekerstar.tdengine.module.sample.domain.entity.CanInfo;
import com.geekerstar.tdengine.module.sample.mapper.CanInfoMapper;
import org.junit.Test;
import org.springframework.beans.factory.annotation.Autowired;

import java.util.List;

/**
 * @author geekerstar
 * @date 2023/5/12 14:36
 */
public class InsertTest extends TdengineApplicationTests{

    @Autowired
    private CanInfoMapper canInfoMapper;

    @Test
    public void test1(){
        String can = "{\"国标数据时间\":\"2023-05-09 14:15:08\",\"车辆状态\":\"车辆启动状态\",\"充电状态\":\"未充电\",\"运行模式\":\"纯电\",\"车速\":\"0\",\"累计里程\":\"55196.1\",\"总电压\":\"597.4\",\"总电流\":\"13.2\",\"soc\":\"92\",\"dc状态\":\"工作\",\"驱动力\":\"无驱动力\",\"制动力\":\"无制动力\",\"档位\":\"自动D挡\",\"绝缘电阻\":42727,\"加速踏板行程值\":\"0\",\"制动踏板状态\":\"0\",\"驱动电机个数\":1,\"驱动电机详情\":[{\"驱动电机序号\":1,\"驱动电机状态\":\"准备状态\",\"驱动电机控制器温度\":\"43\",\"驱动电机转速\":\"0\",\"驱动电机转矩\":\"0\",\"驱动电机温度\":\"57\",\"驱动电机控制器输入电压\":\"590\",\"驱动电机控制器直流母线电流\":\"0\"}],\"定位状态\":\"有效定位\",\"经度\":\"104.102333\",\"纬度\":\"30.706884\",\"最高电压电池子系统代号\":\"6\",\"最高电压电池单体代号\":\"193\",\"电池单体电压最高值\":\"3.322\",\"最低电压电池子系统代号\":\"2\",\"最低电压电池单体代号\":\"48\",\"电池单体电压最低值\":\"3.317\",\"最高温度子系统代号\":\"1\",\"最高温度探针序号\":\"1\",\"最高温度值\":\"26\",\"最低温子系统号\":\"7\",\"最低温度探针序号\":\"37\",\"最低温度值\":\"22\",\"最高报警等级\":\"无报警\",\"通用报警标志\":\"00000000000000000000000000000000\",\"通用报警详情\":{\"温度差异报警\":\"正常\",\"电池高温报警\":\"正常\",\"车载储能装置类型过压报警\":\"正常\",\"车载储能装置类型欠压报警\":\"正常\",\"SOC低报警\":\"正常\",\"单体电池过压报警\":\"正常\",\"单体电池欠压报警\":\"正常\",\"SOC过高报警\":\"正常\",\"SOC跳变报警\":\"正常\",\"可充电储能系统不匹配报警\":\"正常\",\"电池单体一致性差报警\":\"正常\",\"绝缘报警\":\"正常\",\"DC-DC温度报警\":\"正常\",\"制动系统报警\":\"正常\",\"DC-DC状态报警\":\"正常\",\"驱动电机控制器温度报警\":\"正常\",\"高压互锁状态报警\":\"正常\",\"驱动电机温度报警\":\"正常\",\"车载储能装置类型过充\":\"正常\"},\"可充电储能装置故障总数\":0,\"驱动电机故障总数\":0,\"发动机故障总数\":0,\"其他故障总数\":0,\"可充电储能子系统个数(电压)\":\"无效\",\"可充电储能子系统个数(温度)\":\"无效\",\"累计充电量\":\"0000B8D2\",\"瞬时消耗率\":\"FFFF\",\"dcac报警等级\":\"未知类型\",\"aebs状态\":\"未知类型\",\"碰撞等级\":\"无报警\",\"aebs跟踪目标障碍物类型\":\"无目标\",\"左偏离报警\":\"无预警\",\"右偏离报警\":\"无预警\",\"方向盘角度\":\"-7.374\",\"方向盘转向计数器\":-32,\"方向盘角度传感器类型\":\"相对测量原则\",\"z轴旋转率\":\"0.080\",\"y轴横向加速度\":\"-6.687\",\"x轴纵向加速度\":\"-0.500\",\"闭眼一级\":\"触发报警\",\"闭眼二级\":\"触发报警\",\"左顾右盼\":\"触发报警\",\"打哈欠\":\"触发报警\",\"打电话\":\"触发报警\",\"抽烟\":\"触发报警\",\"离岗\":\"触发报警\",\"低头\":\"触发报警\",\"抬头\":\"触发报警\",\"驾驶员变更\":\"触发报警\",\"摄像头遮挡\":\"触发报警\",\"墨镜遮挡\":\"触发报警\",\"双手脱离方向盘\":\"触发报警\",\"单手脱离方向盘\":\"触发报警\",\"长时间驾驶\":\"触发报警\",\"过道超员\":\"触发报警\",\"身份不符\":\"触发报警\",\"未系安全带\":\"触发报警\",\"喝水\":\"触发报警\",\"玩手机\":\"触发报警\",\"身份识别状态\":\"未知类型\",\"人脸抓拍\":\"触发一次抓拍\",\"检测到司机\":\"检测到司机\",\"dms车速\":255,\"adas声音类型\":\"未知类型\",\"adas日夜状态\":\"未知类型\",\"adas停车状态\":\"停车状态\",\"adas车距预警\":\"预警\",\"adas碰撞时间\":\"111111.100\",\"adas故障\":\"无错误\",\"车道偏离禁用\":\"禁用，视同有报警\",\"车道偏离左\":\"偏离预警\",\"车道偏离右\":\"偏离预警\",\"碰撞预警\":\"前车碰撞预警\",\"行人碰撞\":\"有行人碰撞预警\",\"行人区域\":\"有行人处于预警区域，预警\",\"超速使能\":\"开启\",\"超速等级\":\"未知类型\",\"车距等级\":\"车距大于设定值，一级报警\",\"胎压监测模块安装轮胎位置\":\"未知类型\",\"车型定义\":\"4x2轮（前单 后双）\",\"润滑系统状态\":\"休止状态\",\"制动钳左前传感器温度\":21,\"制动钳右前传感器温度\":21,\"制动钳左中传感器温度\":0,\"制动钳右中传感器温度\":0,\"制动钳左后传感器温度\":20,\"制动钳右后传感器温度\":21,\"制动钳本地告警温度设置\":150,\"后舱门状态\":\"关\",\"手刹开关\":\"开\",\"干燥器排气压力开关\":\"关\",\"一号气压报警输入\":\"关\",\"二号气压报警输入\":\"关\",\"前乘客门开关信号\":\"关\",\"后乘客门开关信号\":\"关\",\"充电口舱门信号\":\"关\",\"碰撞信号\":\"未碰撞\",\"应急门开关信号\":\"关\",\"低压电瓶电压\":\"27.60\",\"一号气瓶压力\":\"1744.50\",\"二号气瓶压力\":\"2512.50\",\"转向灯信号\":\"转向灯关闭\",\"危险指示灯信号\":\"关闭\",\"远近光灯信号\":\"未知类型\",\"雨刮信号\":\"关闭\",\"机舱烟雾报警1号传感器除霜器\":\"传感器工作正常\",\"机舱烟雾报警2号传感器顶前部电池舱\":\"传感器工作正常\",\"机舱烟雾报警3号传感器后部顶电池舱\":\"传感器工作正常\",\"机舱烟雾报警4号传感器后电器舱\":\"传感器工作正常\",\"机舱烟雾报警5号传感器后电池舱\":\"传感器工作正常\",\"机舱烟雾报警6号传感器\":\"传感器工作正常\",\"机舱烟雾报警7号传感器\":\"未知类型\",\"机舱烟雾报警8号传感器\":\"未知类型\",\"机舱烟雾报警9号传感器\":\"未知类型\",\"机舱烟雾报警10号传感器\":\"未知类型\",\"soh\":\"95.60\",\"当前最高故障等级\":\"正常\",\"电芯温度最大值\":26,\"电芯温度最小值\":22,\"电芯温度平均值\":23,\"电芯电压最大值\":\"64.01\",\"电芯电压最小值\":\"62.73\",\"电芯电压平均值\":\"62.99\",\"整车系统故障码\":0,\"转向泵故障码\":0,\"轮胎个数\":6,\"轮胎详情\":[{\"轮胎位置\":\"第1轴左外侧\",\"轮胎压力\":107,\"轮胎温度\":\"769.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"},{\"轮胎位置\":\"第2轴左外侧\",\"轮胎压力\":107,\"轮胎温度\":\"513.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"},{\"轮胎位置\":\"第1轴左内侧\",\"轮胎压力\":112,\"轮胎温度\":\"257.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"},{\"轮胎位置\":\"第2轴左内侧\",\"轮胎压力\":111,\"轮胎温度\":\"1281.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"},{\"轮胎位置\":\"未知类型左内侧\",\"轮胎压力\":110,\"轮胎温度\":\"1281.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"},{\"轮胎位置\":\"未知类型左内侧\",\"轮胎压力\":111,\"轮胎温度\":\"1.16\",\"胎压传感器状态检测\":\"正常\",\"车轮状态\":\"正常\",\"胎压传感器错误状态\":\"未知类型\",\"胎压监测模块安装轮胎位置\":\"双前轴\",\"漏气率\":0,\"车型定义\":\"4x2轮（前单 后双）\",\"轮胎温度检测状态\":\"正常\",\"压力检测\":\"未知类型\"}],\"电池箱个数\":10,\"电池箱详情\":[{\"箱内灭火电池箱号\":1,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":4},{\"箱内灭火电池箱号\":2,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":5},{\"箱内灭火电池箱号\":3,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":6},{\"箱内灭火电池箱号\":4,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":7},{\"箱内灭火电池箱号\":5,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":14},{\"箱内灭火电池箱号\":6,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":15},{\"箱内灭火电池箱号\":7,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":0},{\"箱内灭火电池箱号\":8,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":1},{\"箱内灭火电池箱号\":9,\"探测器启动灭火弹类型\":\"保留\",\"火情级别\":\"Normal\",\"故障码\":\"正常\",\"子阀打开或关闭命令\":\"子阀关闭\",\"灭火系统故障码\":0,\"生命信号\":2}],\"全速上传倒计时\":\"0000\",\"msgId\":1656911569520562176,\"车辆编号\":\"10001\",\"网关编号\":\"06220001\",\"租户ID\":1,\"网关时间\":\"2023-05-09 14:15:08\"}";

        CanInfo canInfo = JSONUtil.toBean(can, CanInfo.class);

        canInfoMapper.createAndInsert(canInfo.get车辆编号(), canInfo);
    }


    @Test
    public void test2(){
        List<CanInfo> canInfos = canInfoMapper.selectList(null);
        System.out.println(canInfos);

    }
}
